lambda/src/test/resources/libs/SubscriptionIntrospection2025/subscription1/account.json

{
  "basicInfo" : {
    "id" : "ACCOUNT-ID",
    "name" : "ACCOUNT-NAME",
    "accountNumber" : "ACCOUNT-NUMBER",
    "notes" : null,
    "status" : "Active",
    "crmId" : "ACCOUNT-NAME",
    "batch" : "Batch1",
    "invoiceTemplateId" : "2c92a0fb49377eae014951ca848e074b",
    "communicationProfileId" : null,
    "profileNumber" : null,
    "purchaseOrderNumber" : null,
    "customerServiceRepName" : null,
    "ScrubbedOn__c" : null,
    "IdentityId__c" : "IdentityId__c",
    "sfContactId__c" : "sfContactId__c",
    "CCURN__c" : null,
    "SpecialDeliveryInstructions__c" : null,
    "NonStandardDataReason__c" : null,
    "Scrubbed__c" : null,
    "ProcessingAdvice__c" : null,
    "CreatedRequestId__c" : null,
    "RetryStatus__c" : null,
    "salesRep" : null,
    "creditMemoTemplateId" : null,
    "debitMemoTemplateId" : null,
    "summaryStatementTemplateId" : null,
    "sequenceSetId" : null
  },
  "billingAndPayment" : null,
  "metrics" : {
    "balance" : 0.000000000,
    "currency" : "USD",
    "totalInvoiceBalance" : 0.000000000,
    "creditBalance" : 0.000000000,
    "totalDebitMemoBalance" : 0.000000000,
    "unappliedPaymentAmount" : 0.000000000,
    "unappliedCreditMemoAmount" : 0.000000000,
    "contractedMrr" : 30.000000000
  },
  "billToContact" : null,
  "soldToContact" : {
    "country" : "United States",
  },
  "taxInfo" : null,
  "success" : true
}