lambda/src/test/resources/model/AmendmentEffectiveDateCalculator/subscription1/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-BASIC-INFO-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-BASIC-INFO-NAME",
  "subscriptionNumber": "SUBSCRIPTION-NUMBER",
  "version": 9,
  "revision": "9.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2021-12-14",
  "serviceActivationDate": "2021-12-14",
  "customerAcceptanceDate": "2021-12-14",
  "subscriptionStartDate": "2025-02-24",
  "subscriptionEndDate": "2025-12-24",
  "lastBookingDate": "2024-11-05",
  "termStartDate": "2024-12-24",
  "termEndDate": "2025-12-24",
  "initialTerm": 375,
  "initialTermPeriodType": "Day",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "EUR",
  "contractedMrr": 26.5,
  "totalContractedValue": 1127.2,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "CreatedRequestId__c",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "10ANNUAL",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "10ANNUAL",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a12820a92f75e4b0192fb236407617a",
      "lastChangeType": "Remove",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fe6619b4b901661aa8e66c1692",
      "productRatePlanNumber": null,
      "ratePlanName": "GW Oct 18 - Annual - Domestic",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04068585",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12820a92f75e4b0192fb236407617b",
          "originalChargeId": "8a128c0b8440f7490184469bb8f503ee",
          "productRatePlanChargeId": "2c92a0fe6619b4b901661aa8e6811695",
          "number": "C-04068585",
          "name": "GW Oct 18 - Annual - Domestic",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 5,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-12-24",
          "effectiveEndDate": "2024-12-24",
          "processedThroughDate": "2024-12-24",
          "chargedThroughDate": "2024-12-24",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 23.5,
          "dmrc": 0.0,
          "tcv": 564.0,
          "dtcv": -282.0,
          "originalOrderDate": "2022-11-05",
          "amendedByOrderOn": "2024-11-05",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR282",
          "price": 282.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12820a92f75e4b0192fb2364496183",
      "lastChangeType": "Add",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fe6619b4b901661aa8e66c1692",
      "productRatePlanNumber": "PRP-00000122",
      "ratePlanName": "GW Oct 18 - Annual - Domestic",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05835839",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12820a92f75e4b0192fb23644b6185",
          "originalChargeId": "8a12820a92f75e4b0192fb23629e615b",
          "productRatePlanChargeId": "2c92a0fe6619b4b901661aa8e6811695",
          "number": "C-06089952",
          "name": "GW Oct 18 - Annual - Domestic",
          "productRatePlanChargeNumber": "PRPC-00000192",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-12-24",
          "effectiveEndDate": "2025-12-24",
          "processedThroughDate": "2024-12-24",
          "chargedThroughDate": "2025-12-24",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 26.5,
          "dmrc": 26.5,
          "tcv": 318.0,
          "dtcv": 318.0,
          "originalOrderDate": "2024-11-05",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR318",
          "price": 318.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12820a92f75e4b0192fb23644e6188",
      "lastChangeType": "Remove",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fe6619b4b901661aa8e66c1692",
      "productRatePlanNumber": null,
      "ratePlanName": "GW Oct 18 - Annual - Domestic",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-03262506",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12820a92f75e4b0192fb236451618a",
          "originalChargeId": "8a1280347da7db40017db987b2ca3e1f",
          "productRatePlanChargeId": "2c92a0fe6619b4b901661aa8e6811695",
          "number": "C-03262506",
          "name": "GW Oct 18 - Annual - Domestic",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-12-24",
          "effectiveEndDate": "2022-12-24",
          "processedThroughDate": "2022-12-24",
          "chargedThroughDate": "2022-12-24",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 20.433333333,
          "dmrc": 0.0,
          "tcv": 245.2,
          "dtcv": 6.811111104,
          "originalOrderDate": "2021-12-14",
          "amendedByOrderOn": "2022-11-05",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "EUR245.2",
          "price": 245.2,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12820a92f75e4b0192fb236453618d",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff5345f9220153559d915d5c26",
      "productRatePlanNumber": null,
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-03262505",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a12820a92f75e4b0192fb236456618f",
          "originalChargeId": "8a1280347da7db40017db987b2753e18",
          "productRatePlanChargeId": "2c92a0fd5345efa10153559e97bb76c6",
          "number": "C-03262505",
          "name": "Percentage",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "DiscountPercentage",
          "originalListPrice": null,
          "uom": null,
          "version": 2,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "EUR",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2021-12-24",
          "effectiveEndDate": "2022-12-24",
          "processedThroughDate": "2021-12-24",
          "chargedThroughDate": "2022-01-24",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2021-12-14",
          "amendedByOrderOn": "2022-11-05",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "10%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 10.0
        }
      ]
    }
  ],
  "orderNumber": "O-03634084",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2021-12-14",
      "endDate": "2025-12-24",
      "status": "Active"
    },
    {
      "startDate": "2025-12-24",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-11-05 07:04:13",
  "updateTime": "2024-12-24 04:14:51",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null
}
